[{"id":"14066888-66f6-4903-8de2-cc961aa45d8d","name":"Unleash the Flux","typeLine":"Phenomenon","oracleText":"When you encounter Unleash the Flux, each player sacrifices a nonland permanent, then you flip a coin. If you lose the flip, repeat this process. (Then planeswalk away from this phenomenon.)","sets":["who"],"isUB":true},{"id":"a7641877-1a61-467c-9365-487cf5a5656d","name":"UNIT Headquarters","typeLine":"Plane — Earth","oracleText":"When you planeswalk to UNIT Headquarters and at the beginning of your upkeep, create a tapped 1/1 white Soldier creature token.\nWhenever chaos ensues, put a +1/+1 counter on each creature you control.","sets":["who"],"isUB":true},{"id":"d8aa7f2d-2280-42d4-b082-1b5d45df77c5","name":"Two Streams Facility","typeLine":"Plane — Apalapucia","oracleText":"Whenever you planeswalk to Two Streams Facility and at the beginning of the first upkeep of the game, each player chooses green anchor or red waterfall. Each player who last chose green anchor may play an additional land during each of their turns. Creatures controlled by players who last chose red waterfall get +2/+0 and have haste.\nWhenever chaos ensues, each player who last chose green anchor chooses red waterfall, and vice versa.","sets":["who"],"isUB":true},{"id":"9c925057-ac3d-461e-b505-f80e2fd38c8c","name":"Temple of Atropos","typeLine":"Plane — Time","oracleText":"At the beginning of your postcombat main phase, there is an additional beginning phase after this phase. (The beginning phase includes the untap, upkeep, and draw steps.)\nWhen chaos ensues, reverse the game's turn order. Then planeswalk. (For example, if play had proceeded clockwise around the table, it now goes counterclockwise.)","sets":["who"],"isUB":true},{"id":"424b2702-e7c6-4056-8466-a43782d7df2b","name":"TARDIS Bay","typeLine":"Plane — Gallifrey","oracleText":"The first spell you cast during each of your turns with mana value 2 or greater has cascade. (When you cast that spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom in a random order.)\nWhen chaos ensues, gain control of target artifact. Then planeswalk.","sets":["who"],"isUB":true},{"id":"204ee01c-74ca-4c4c-92db-aebeebb89406","name":"Stormcage Containment Facility","typeLine":"Plane — Unknown Planet","oracleText":"Each creature card in your graveyard has escape. The escape cost is equal to the card's mana cost plus exile three other cards from your graveyard. (You may cast cards from your graveyard for their escape cost.)\nWhenever chaos ensues, detain target creature an opponent controls. (Until your next turn, that creature can't attack or block and its activated abilities can't be activated.)","sets":["who"],"isUB":true},{"id":"4f387b4c-3e4a-419d-9dbe-95c5f797747e","name":"Spectrox Mines","typeLine":"Plane — Androzani Minor","oracleText":"When you planeswalk to Spectrox Mines and at the beginning of your upkeep, you lose 3 life and create a Treasure token.\nWhenever chaos ensues, create a Food token and a 2/2 black Human Rogue creature token.","sets":["who"],"isUB":true},{"id":"99fb2128-61fc-45a6-a3f8-b116c3eb2c3d","name":"Singing Towers of Darillium","typeLine":"Plane — Darillium","oracleText":"Each nonland card in your hand without foretell has foretell. Its foretell cost is equal to its mana cost reduced by {2}. (During your turn, you may pay {2} and exile it from your hand face down. Cast it on a later turn for its foretell cost.)\nWhenever chaos ensues, you may cast a foretold card you own from exile without paying its mana cost this turn.","sets":["who"],"isUB":true},{"id":"5910ae7e-7a74-4296-9ae1-7fa093b4e640","name":"The Pyramid of Mars","typeLine":"Plane — Mars","oracleText":"When you planeswalk to The Pyramid of Mars and at beginning of your upkeep, surveil 2. (Look at the top two cards of your library, then put any number of them into your graveyard and the rest on top of your library in any order.)\nWhenever chaos ensues, return target creature card from your graveyard to the battlefield.","sets":["who"],"isUB":true},{"id":"b3acbacd-7e97-4bcf-9281-fffa5ea3e70b","name":"Prime Minister's Cabinet Room","typeLine":"Plane — Earth","oracleText":"At the beginning of combat on your turn, up to one target creature you control becomes a copy of target creature an opponent controls.\nWill of the council — Whenever chaos ensues, starting with you, each player votes for a creature you don't control. Exile each creature with the most votes or tied for most votes.","sets":["who"],"isUB":true},{"id":"5dc1deab-ce04-45c0-a4ff-c526a948e500","name":"Pompeii","typeLine":"Plane — Earth","oracleText":"When you planeswalk to Pompeii and at the beginning of your upkeep, put an eruption counter on it.\nWhenever you roll a blank on the planar die, scry 2. Then put an eruption counter on Pompeii.\nWhen chaos ensues, Pompeii deals damage to each creature and each player equal to the number of eruption counters on Pompeii. Each player sacrifices a land. Then planeswalk.","sets":["who"],"isUB":true},{"id":"8bf638e5-8325-48ca-9039-37a19761ef56","name":"Ood Sphere","typeLine":"Plane — Horsehead Nebula","oracleText":"Song of the Ood — Noncreature spells have convoke. (A player's creatures can help cast those spells. Each creature they tap while casting a noncreature spell pays for 1 or one mana of that creature's color.)\nRed-Eye — Whenever chaos ensues, for each opponent, goad up to one target creature that opponent controls. Until end of turn, those creatures can't become tapped unless they're being declared as attackers.","sets":["who"],"isUB":true},{"id":"a2dfbb3e-3d5f-4b6a-b910-4c7b0c9dc17a","name":"North Pole Research Base","typeLine":"Plane — Earth","oracleText":"At the beginning of your upkeep, target opponent draws a card and creates a Treasure token.\nWhenever chaos ensues, create a 2/2 white Alien creature token. When you do, tap target nontoken creature an opponent controls. Put a stun counter on it. (If a permanent with a stun counter would become untapped, remove one from it instead.)","sets":["who"],"isUB":true},{"id":"4f8cf1ab-1359-44af-a989-dd254fa6c7b5","name":"New New York","typeLine":"Plane — New Earth","oracleText":"At the beginning of combat on your turn, until end of turn, noncreature artifacts you control become 3/3 Vehicles in addition to their other types and gain flying, haste, and crew 1.\nWhenever chaos ensues, create a Treasure token and a 2/2 white Alien creature token.","sets":["who"],"isUB":true},{"id":"381f510b-8696-4af1-a6c9-d1175e9f36d0","name":"The Moonbase","typeLine":"Plane — Moon","oracleText":"Low Gravity — All creatures have \"{2}: This creature gains flying until end of turn. Activate only as a sorcery.\"\nWhenever chaos ensues, for each opponent, choose up to one target creature card in that player's graveyard. Put those cards onto the battlefield face down under your control. They're 2/2 Cyberman artifact creatures.","sets":["who"],"isUB":true},{"id":"9cc34a5b-550d-4d3e-b3e5-4d4630649882","name":"Mondassian Colony Ship","typeLine":"Plane — Spacecraft","oracleText":"Whenever a creature attacks, it gets +1/+1 until end of turn for each other creature its controller controls that shares a creature type with it.\nWhenever chaos ensues, turn target creature face down. It becomes a 2/2 Cyberman artifact creature.","sets":["who"],"isUB":true},{"id":"ed44d47b-2eea-4cb2-a091-07583bdf390f","name":"The Matrix of Time","typeLine":"Plane — Gallifrey","oracleText":"When you planeswalk to The Matrix of Time, each player exiles the top card of their library.\nDuring your turn, you may play lands and cast spells from among cards exiled with The Matrix of Time.\nWhenever you play a land or cast a spell from among cards exiled with The Matrix of Time, that card's owner loses 3 life and exiles the top card of their library.\nWhenever chaos ensues, create two Treasure tokens.","sets":["who"],"isUB":true},{"id":"68750b81-1309-4362-84b3-8835b3d71d28","name":"The Lux Foundation Library","typeLine":"Plane — The Library","oracleText":"Players have no maximum hand size.\nWhenever a creature you control deals combat damage to a player, you may draw a card.\nWhenever chaos ensues, put a shadow counter on target creature. (A creature with shadow can block or be blocked by only creatures with shadow.)","sets":["who"],"isUB":true},{"id":"4dffc1cb-e9bd-4410-9b08-184eabd2c4da","name":"Lake Silencio","typeLine":"Plane — Earth","oracleText":"Still Point in Time — All spells have split second. (As long as a spell with split second is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nWhenever chaos ensues, Lake Silencio deals 6 damage to target creature an opponent controls. If a creature dealt damage this way would die this turn, exile it instead.","sets":["who"],"isUB":true},{"id":"71bff56b-733c-4d74-9e0c-85371a8b3787","name":"Kerblam! Warehouse","typeLine":"Plane — Kandoka","oracleText":"Whenever one or more creatures you control deal combat damage to a player, create a Treasure token.\nWhenever chaos ensues, until your next turn, noncreature artifacts you control gain \"{T}, Sacrifice this artifact: Flip a coin. If you win the flip, this artifact deals 3 damage to any target.\"","sets":["who"],"isUB":true},{"id":"96e26369-ae5d-4a77-adaa-d34b25af076f","name":"Human-Time Lord Meta-Crisis","typeLine":"Phenomenon","oracleText":"When you encounter Human-Time Lord Meta-Crisis, each player chooses one or two creatures they control. Each player creates a token that's a copy of the first creature they chose, except it isn't legendary. Then each player who chose a second creature puts a number of +1/+1 counters on the token they created equal to the power of the second creature they chose. (Then planeswalk away from this phenomenon.)","sets":["who"],"isUB":true},{"id":"79d3e356-9eb9-49bb-b4ba-f4f71876869e","name":"Hotel of Fears","typeLine":"Plane — Spacecraft","oracleText":"At the beginning of your upkeep, exile the top card of your library. You lose life equal to its mana value. You may play that card this turn.\nPraise Him — Whenever chaos ensues, choose a color. Put X +1/+1 counters on target creature you control, where X is your devotion to that color. Then sacrifice another creature. (Your devotion to a color is the number of mana symbols of that color in the mana costs of permanents you control.)","sets":["who"],"isUB":true},{"id":"d45692d5-19e8-45ec-92bf-b79cb3919acd","name":"Gardens of Tranquil Repose","typeLine":"Plane — Necros","oracleText":"Suspended Animation — Whenever a creature dies, exile it. Its controller scries 1.\nWhenever chaos ensues, create X 3/3 black Dalek artifact creature tokens with menace, where X is one plus the number of cards exiled with Gardens of Tranquil Repose.","sets":["who"],"isUB":true},{"id":"be9870be-cf1b-44ea-a129-8f3711901b16","name":"Fixed Point in Time","typeLine":"Phenomenon","oracleText":"When you encounter Fixed Point in Time, until your next turn, if a player would planeswalk as a result of rolling the planar die, chaos ensues instead. (Then planeswalk away from this phenomenon.)","sets":["who"],"isUB":true},{"id":"9f7e1607-34b5-4332-81e3-391fb49cd6ad","name":"The Drum, Mining Facility","typeLine":"Plane — Earth","oracleText":"Whenever you roll the planar die, creatures you control get +1/+1 and gain haste until end of turn.\nWhenever chaos ensues, end the turn. (Exile all spells and abilities from the stack. The player whose turn it is discards down to their maximum hand size. Damage wears off, and \"this turn\" and \"until end of turn\" effects end.)","sets":["who"],"isUB":true},{"id":"fc621e94-e7c7-49ea-9547-4ab041ea39f3","name":"The Doctor's Tomb","typeLine":"Plane — Trenzalore","oracleText":"If a creature would die, instead exile it and that creature's controller loses 2 life.\nWhenever chaos ensues, redistribute any number of players' life totals. (Each of those players gets one life total back.)","sets":["who"],"isUB":true},{"id":"2a21b90a-7ea7-4090-82ec-359ba8ba1aad","name":"The Doctor's Childhood Barn","typeLine":"Plane — Gallifrey","oracleText":"Creatures enter the battlefield tapped.\nWhenever chaos ensues, for each opponent, choose up to one target nonland permanent that opponent controls. Untap those permanents. They phase out. They can't phase in for as long as The Doctor's Childhood Barn remains face up. When a player planeswalks, those permanents phase in.","sets":["who"],"isUB":true},{"id":"7099883d-0a4b-47ae-bff8-a96efa7a3a9a","name":"The Dining Car","typeLine":"Plane — Spacecraft","oracleText":"When you planeswalk to The Dining Car, each player creates a Food token.\nSixty-Six Seconds — At the beginning of your upkeep, sacrifice a creature with the least toughness among creatures you control. Then investigate.\nWhenever chaos ensues, activated abilities of artifact tokens you control cost {2} less to activate this turn.","sets":["who"],"isUB":true},{"id":"2edd018b-6d82-4ff1-b9d0-5da9b628af3f","name":"Dalek Intensive Care","typeLine":"Plane — The Dalek Asylum","oracleText":"When you planeswalk to Dalek Intensive Care and at the beginning of your upkeep, exile a non-Dalek creature you control. If you do, create a 3/3 black Dalek artifact creature token with menace. It gains haste until end of turn.\nWhenever chaos ensues, target Dalek you control deals damage equal to its power to target creature you don't control.","sets":["who"],"isUB":true},{"id":"51a53042-6baa-442a-84ec-2f16fdc12087","name":"Coal Hill School","typeLine":"Plane — Earth","oracleText":"Whenever a player casts a historic spell, that player draws a card. (Artifacts, legendaries, and Sagas are historic.)\nWhenever chaos ensues, return target historic card from your graveyard to your hand.","sets":["who"],"isUB":true},{"id":"a2ef6b79-faeb-4183-a510-f10b14dff417","name":"City of the Daleks","typeLine":"Plane — Skaro","oracleText":"Whenever you attack, target opponent loses X life, where X is the number of artifacts you control.\nWhenever chaos ensues, for each opponent, you create a 3/3 black Dalek artifact creature token with menace that attacks that opponent this turn if able. Those tokens gain haste. Sacrifice them at the beginning of the next end step.","sets":["who"],"isUB":true},{"id":"0c4679a1-f92f-44a9-9a44-066a137c8cd7","name":"The Cheetah Planet","typeLine":"Plane — Outside Mutter's Spiral","oracleText":"When you planeswalk to The Cheetah Planet and at the beginning of your upkeep, put two +1/+1 counters on target non-Cat creature you control. It becomes a Cat in addition to its other types.\nWhenever chaos ensues, all Cats gain provoke until end of turn. (Whenever a Cat attacks, its controller may have target creature defending player controls untap and block it if able.)","sets":["who"],"isUB":true},{"id":"6ad7027a-5f13-4833-bb88-879ba8830720","name":"The Cave of Skulls","typeLine":"Plane — Earth","oracleText":"Each creature card in your graveyard has scavenge. The scavenge cost is equal to its mana cost. (Exile a creature card from your graveyard and pay its mana cost: Put a number of +1/+1 counters equal to that card's power on target creature. Scavenge only as a sorcery.)\nWhenever chaos ensues, create two 1/1 white Warrior creature tokens.","sets":["who"],"isUB":true},{"id":"c265447b-a8ce-4d77-b620-865f7d4e0722","name":"Caught in a Parallel Universe","typeLine":"Phenomenon","oracleText":"When you encounter Caught in a Parallel Universe, each player chooses a creature controlled by the player to their left. Each player creates a token that's a copy of the creature they chose, except it has menace. (Then planeswalk away from this phenomenon.)","sets":["who"],"isUB":true},{"id":"7076bc0c-9cc7-4cd7-aba5-f2f236aab0f7","name":"Bowie Base One","typeLine":"Plane — Mars","oracleText":"At the beginning of your end step, goad target creature controlled by the player to your left. (Until your next turn, that creature attacks each combat if able and attacks a player other than you if able.)\nWhenever chaos ensues, target creature gains islandwalk until end of turn. (It can't be blocked as long as defending player controls an Island.)","sets":["who"],"isUB":true},{"id":"75206757-dae7-4a1e-a391-862699a100d7","name":"Besieged Viking Village","typeLine":"Plane — Earth","oracleText":"All creatures have \"Boast — {1}: Put a +1/+1 counter on this creature.\" (Activate only if that creature attacked this turn and only once each turn.)\nWhenever chaos ensues, put an indestructible counter on target creature you control that attacked this turn.","sets":["who"],"isUB":true},{"id":"706720f6-bb04-4a7b-8471-0f3d662d6eeb","name":"Bad Wolf Bay","typeLine":"Plane — Earth","oracleText":"At the beginning of combat on your turn, exile up to one target creature. Return it to the battlefield under its owner's control at the beginning of the next end step.\nWhen chaos ensues, cards can't enter the battlefield from exile this turn. Then planeswalk.","sets":["who"],"isUB":true},{"id":"7c9d6193-1d50-4035-8c85-98c384f461be","name":"Aplan Mortarium","typeLine":"Plane — Alfava Metraxis","oracleText":"Byzantium Radiation — At the beginning of your upkeep, put an exposure counter on Aplan Mortarium. Then you lose life equal to the number of exposure counters on it.\nWhenever chaos ensues, create two 2/2 black Alien Angel artifact creature tokens with first strike, vigilance, and \"Whenever an opponent casts a creature spell, this permanent isn't a creature until end of turn.\"","sets":["who"],"isUB":true},{"id":"d65ff607-1ff5-42bd-8db2-f082cc2f0b5e","name":"Antarctic Research Base","typeLine":"Plane — Earth","oracleText":"When you planeswalk to Antarctic Research Base and at the beginning of your upkeep, investigate.\nWhenever chaos ensues, put X +1/+1 counters on target creature you control, where X is the number of artifacts you control. It becomes a Plant in addition to its other types.","sets":["who"],"isUB":true},{"id":"5b200e41-126d-4017-8e01-f50582b31af0","name":"Amy's Home","typeLine":"Plane — Earth","oracleText":"When you planeswalk to Amy's Home and at the beginning of your upkeep, you may exile a nonland card from your hand with a number of time counters on it equal to its mana value. If it doesn't have suspend, it gains suspend.\nWhenever chaos ensues, time travel. (For each suspended card you own and each permanent you control with a time counter on it, you may add or remove a time counter.)","sets":["who"],"isUB":true},{"id":"f3f5a033-d063-4250-9cfe-4c3c1a2725f1","name":"Undercity Reaches","typeLine":"Plane — Ravnica","oracleText":"Whenever a creature deals combat damage to a player, its controller may draw a card.\nWhenever chaos ensues, you have no maximum hand size for the rest of the game.","sets":["moc","opca","ohop"],"isUB":false},{"id":"1300b5e7-d741-4723-bb15-dabd04cb0c11","name":"Turri Island","typeLine":"Plane — Ir","oracleText":"Creature spells cost {2} less to cast.\nWhenever chaos ensues, reveal the top three cards of your library. Put all creature cards revealed this way into your hand and the rest into your graveyard.","sets":["moc","opca","ohop"],"isUB":false},{"id":"d858e6db-9842-41d1-8006-574c8dcd98ed","name":"Truga Jungle","typeLine":"Plane — Ergamon","oracleText":"All lands have \"{T}: Add one mana of any color.\"\nWhenever chaos ensues, reveal the top three cards of your library. Put all land cards revealed this way into your hand and the rest on the bottom of your library in any order.","sets":["moc","opca","opc2"],"isUB":false},{"id":"ff76b576-8ad3-44f9-8043-80003a078e84","name":"Stronghold Furnace","typeLine":"Plane — Rath","oracleText":"If a source would deal damage to a permanent or player, it deals double that damage instead.\nWhenever chaos ensues, Stronghold Furnace deals 1 damage to any target.","sets":["moc","opca","ohop"],"isUB":false},{"id":"38bdd034-0375-403c-97ca-6f93a5e12e54","name":"Stensia","typeLine":"Plane — Innistrad","oracleText":"Whenever a creature deals damage to one or more players for the first time each turn, put a +1/+1 counter on it.\nWhenever chaos ensues, each creature you control gains \"{T}: This creature deals 1 damage to target player or planeswalker\" until end of turn.","sets":["moc","opca","opc2"],"isUB":false},{"id":"aa166578-b13b-4adb-a78e-d5183e987112","name":"Spatial Merging","typeLine":"Phenomenon","oracleText":"When you encounter Spatial Merging, reveal cards from the top of your planar deck until you reveal two plane cards. Simultaneously planeswalk to both of them. Put all other cards revealed this way on the bottom of your planar deck in any order.","sets":["moc","opca","opc2"],"isUB":false},{"id":"c09d304a-87d0-4a2a-bcb2-e81341b2dbf2","name":"Sokenzan","typeLine":"Plane — Kamigawa","oracleText":"All creatures get +1/+1 and have haste.\nWhenever chaos ensues, untap all creatures that attacked this turn. If it's a main phase, there is an additional combat phase after this phase, followed by an additional main phase.","sets":["moc","opca","ohop"],"isUB":false},{"id":"0a4bf88d-106a-413b-9d80-8775c1ff5ded","name":"Selesnya Loft Gardens","typeLine":"Plane — Ravnica","oracleText":"If an effect would create one or more tokens, it creates twice that many of those tokens instead.\nIf an effect would put one or more counters on a permanent, it puts twice that many of those counters on that permanent instead.\nWhenever chaos ensues, until end of turn, whenever you tap a land for mana, add one mana of any type that land produced.","sets":["moc","opca","opc2"],"isUB":false},{"id":"3fc15821-1add-4321-aecd-33f8a8c5f9a7","name":"Reality Shaping","typeLine":"Phenomenon","oracleText":"When you encounter Reality Shaping, starting with you, each player may put a permanent card from their hand onto the battlefield. (Then planeswalk away from this phenomenon.)","sets":["moc","opca","opc2"],"isUB":false},{"id":"a34b272b-084b-4ff1-8b02-d95116ccfeab","name":"Planewide Disaster","typeLine":"Phenomenon","oracleText":"When you encounter Planewide Disaster, destroy all creatures. (Then planeswalk away from this phenomenon.)","sets":["moc","opca","opc2"],"isUB":false},{"id":"cd8ce6f1-9753-40a7-a625-5ed63c15c29e","name":"Panopticon","typeLine":"Plane — Mirrodin","oracleText":"When you planeswalk to Panopticon, draw a card.\nAt the beginning of your draw step, draw an additional card.\nWhenever chaos ensues, draw a card.","sets":["moc","opca","ohop"],"isUB":false},{"id":"6e008fdc-48f2-40ef-95bd-80d014535ca3","name":"Orochi Colony","typeLine":"Plane — Kamigawa","oracleText":"Whenever a creature you control deals combat damage to a player, you may search your library for a basic land card, put it onto the battlefield tapped, then shuffle.\nWhenever chaos ensues, target creature can't be blocked this turn.","sets":["moc","opca","opc2"],"isUB":false},{"id":"c871974e-54e6-411f-8408-3708823fa2df","name":"Mutual Epiphany","typeLine":"Phenomenon","oracleText":"When you encounter Mutual Epiphany, each player draws four cards. (Then planeswalk away from this phenomenon.)","sets":["moc","opca","opc2"],"isUB":false},{"id":"2732b605-7c88-4995-b46e-62dc09e68919","name":"Krosa","typeLine":"Plane — Dominaria","oracleText":"All creatures get +2/+2.\nWhenever chaos ensues, you may add {W}{U}{B}{R}{G}.","sets":["moc","opca","ohop"],"isUB":false},{"id":"256770fe-c17d-45dd-bf05-36eeee240324","name":"Kharasha Foothills","typeLine":"Plane — Mongseng","oracleText":"Whenever a creature you control attacks a player, for each other opponent, you may create a token that's a copy of that creature, tapped and attacking that opponent. Exile those tokens at the beginning of the next end step.\nWhenever chaos ensues, you may sacrifice any number of creatures. If you do, Kharasha Foothills deals that much damage to target creature.","sets":["moc","opca","opc2"],"isUB":false},{"id":"9aa94de8-b114-4479-a771-c7bc0297be58","name":"Jund","typeLine":"Plane — Alara","oracleText":"Whenever a player casts a creature spell that's black, red, or green, it gains devour 5. (As the creature enters the battlefield, its controller may sacrifice any number of creatures. The creature enters the battlefield with five times that many +1/+1 counters on it.)\nWhenever chaos ensues, create two 1/1 red Goblin creature tokens.","sets":["moc","opca","opc2"],"isUB":false},{"id":"f017380f-97db-4a36-b111-b257aa17ebaf","name":"Isle of Vesuva","typeLine":"Plane — Dominaria","oracleText":"Whenever a nontoken creature enters the battlefield, its controller creates a token that's a copy of that creature.\nWhenever chaos ensues, destroy target creature and all other creatures with the same name as that creature.","sets":["moc","opca","ohop"],"isUB":false},{"id":"1f7daaf2-3206-4f52-928a-f5116b782367","name":"Hedron Fields of Agadeem","typeLine":"Plane — Zendikar","oracleText":"Creatures with power 7 or greater can't attack or block.\nWhenever chaos ensues, create a 7/7 colorless Eldrazi creature token with annihilator 1. (Whenever it attacks, defending player sacrifices a permanent.)","sets":["moc","opca","opc2"],"isUB":false},{"id":"3e553881-bac7-4830-b739-3b8c6aa0ded6","name":"Grove of the Dreampods","typeLine":"Plane — Fabacin","oracleText":"When you planeswalk to Grove of the Dreampods and at the beginning of your upkeep, reveal cards from the top of your library until you reveal a creature card. Put that card onto the battlefield and the rest on the bottom of your library in a random order.\nWhenever chaos ensues, return target creature card from your graveyard to the battlefield.","sets":["moc","opca","opc2"],"isUB":false},{"id":"8c56bb41-a8d8-4b0f-bbb7-be8466dc9ed1","name":"The Great Forest","typeLine":"Plane — Lorwyn","oracleText":"Each creature assigns combat damage equal to its toughness rather than its power.\nWhenever chaos ensues, creatures you control get +0/+2 and gain trample until end of turn.","sets":["moc","opca","ohop"],"isUB":false},{"id":"43a23de7-0738-4b03-b87d-5a7d1144825c","name":"Glimmervoid Basin","typeLine":"Plane — Mirrodin","oracleText":"Whenever a player casts an instant or sorcery spell with a single target, that player copies that spell for each other spell, permanent, card not on the battlefield, and/or player the spell could target. Each copy targets a different one of them.\nWhenever chaos ensues, choose target creature. Each player except that creature's controller creates a token that's a copy of that creature.","sets":["moc","opca","ohop"],"isUB":false},{"id":"2387edac-765b-4502-bd3d-88be8ba7d0a4","name":"Gavony","typeLine":"Plane — Innistrad","oracleText":"All creatures have vigilance.\nWhenever chaos ensues, creatures you control gain indestructible until end of turn.","sets":["moc","opca","opc2"],"isUB":false},{"id":"6dc67a65-31bf-4535-9e02-8f6d6ecefde5","name":"Chaotic Aether","typeLine":"Phenomenon","oracleText":"When you encounter Chaotic Aether, each blank roll of the planar die is a {CHAOS} roll until a player planeswalks away from a plane. (Then planeswalk away from this phenomenon.)","sets":["moc","opca","opc2"],"isUB":false},{"id":"ce8139b9-31f3-464d-86ea-7efbdbfce478","name":"Bloodhill Bastion","typeLine":"Plane — Equilor","oracleText":"Whenever a creature enters the battlefield, it gains double strike and haste until end of turn.\nWhenever chaos ensues, exile target nontoken creature you control, then return it to the battlefield under your control.","sets":["moc","opca","opc2"],"isUB":false},{"id":"8eb442a9-5e61-4e2e-983d-b49b04be2575","name":"The Aether Flues","typeLine":"Plane — Iquatana","oracleText":"When you planeswalk to The Aether Flues and at the beginning of your upkeep, you may sacrifice a creature. If you do, reveal cards from the top of your library until you reveal a creature card, put that card onto the battlefield, then shuffle all other cards revealed this way into your library.\nWhenever chaos ensues, you may put a creature card from your hand onto the battlefield.","sets":["moc","opca","ohop"],"isUB":false},{"id":"cb7ae16a-9982-4782-9e20-07bb771d0601","name":"The Wilds","typeLine":"Plane — Eldraine","oracleText":"When you planeswalk to The Wilds and at the beginning of your upkeep, create a Food token.\nWhenever chaos ensues, target player sacrifices a creature. If they do, you create a Food token. You create two Food tokens instead if the sacrificed creature's toughness was 4 or greater.","sets":["moc"],"isUB":false},{"id":"4abae901-eb47-4318-bf64-322a893c2833","name":"The Western Cloud","typeLine":"Plane — Gobakhan","oracleText":"Prevent all damage that would be dealt to creatures and planeswalkers you control.\nWhenever chaos ensues, create three tapped Treasure tokens. They each deal 1 damage to each creature and each planeswalker.","sets":["moc"],"isUB":false},{"id":"61b5984a-de6a-4d5a-8b20-e2fb3b553a34","name":"Valor's Reach","typeLine":"Plane — Kylem","oracleText":"Whenever your team attacks with exactly two creatures, those creatures gain double strike until end of turn.\nWhenever chaos ensues, untap up to two target creatures your team controls. If it's a main phase, there is an additional combat phase after this phase, followed by an additional main phase.","sets":["moc"],"isUB":false},{"id":"503fcc43-dafd-484b-a97f-bbd11eed66de","name":"Unyaro","typeLine":"Plane — Zhalfir","oracleText":"At the beginning of your end step, if you planeswalked to Unyaro this turn, untap all creatures. They phase out until a player planeswalks. (Treat them and anything attached to them as though they didn't exist.)\nWhenever chaos ensues, create two 2/2 white and blue Knight creature tokens with vigilance.","sets":["moc"],"isUB":false},{"id":"0c1cb8e2-8ed4-4a0e-926b-4df5466c607c","name":"Towashi","typeLine":"Plane — Kamigawa","oracleText":"Modified creatures you control have trample and \"Whenever this creature deals combat damage to a player or planeswalker, draw a card.\" (Equipment, Auras you control, and counters are modifications.)\nWhenever chaos ensues, distribute three +1/+1 counters among one, two, or three target creatures you control.","sets":["moc"],"isUB":false},{"id":"a0cb118e-6af1-41d2-847f-d685ced2165d","name":"Ten Wizards Mountain","typeLine":"Plane — Shenmeng","oracleText":"Whenever you roll the planar die, put a +1/+1 counter on up to one target creature.\nWhenever chaos ensues, creatures you control gain flying until end of turn.","sets":["moc"],"isUB":false},{"id":"022e38c3-fcea-428f-a0d0-a6cca057faa3","name":"Strixhaven","typeLine":"Plane — Arcavios","oracleText":"Instant and sorcery spells players cast have demonstrate. (Whenever a player casts an instant or sorcery spell, they may copy it. If they do, they choose an opponent to also copy it. Players may choose new targets for their copies.)\nWhenever chaos ensues, return up to one target instant or sorcery card from a graveyard to its owner's hand.","sets":["moc"],"isUB":false},{"id":"91fe554b-13db-451d-ab25-717ab2b70649","name":"Riptide Island","typeLine":"Plane — Dominaria","oracleText":"When you planeswalk to Riptide Island and at the beginning of your upkeep, create two 1/1 colorless Sliver creature tokens.\nWhenever chaos ensues, Slivers you control gain haste and get +X/+X until end of turn, where X is the number of Slivers you control.","sets":["moc"],"isUB":false},{"id":"b60e8617-fc35-4c8a-beb0-4688b88484c4","name":"The Pit","typeLine":"Plane — The Abyss","oracleText":"When you planeswalk to The Pit, each player creates their choice of a 3/3 white Angel creature token with flying or a 6/6 black Demon creature token with flying, trample, and \"At the beginning of your upkeep, sacrifice another creature. If you can't, this creature deals 6 damage to you.\"\nWhenever chaos ensues, each player sacrifices a nonartifact creature.","sets":["moc"],"isUB":false},{"id":"c5f0da12-b76f-42fb-a52e-cd09535e72fb","name":"Paliano","typeLine":"Plane — Fiora","oracleText":"When one or more creatures you control deal combat damage to a player, if there is no monarch, you become the monarch.\nWhenever chaos ensues, create a 1/1 black Assassin creature token with deathtouch and haste.","sets":["moc"],"isUB":false},{"id":"6552e3dd-ce35-4267-a25e-f5d4dceb8311","name":"Nyx","typeLine":"Plane — Theros","oracleText":"Nontoken creatures are enchantments in addition to their other types.\nConstellation — Whenever an enchantment enters the battlefield under your control, you gain 1 life.\nWhenever chaos ensues, choose a color. Add an amount of mana of that color equal to your devotion to that color.","sets":["moc"],"isUB":false},{"id":"ab72ff80-738a-4468-aecf-5d806143f791","name":"Norn's Seedcore","typeLine":"Plane — New Phyrexia","oracleText":"When you planeswalk to Norn's Seedcore, chaos ensues.\nWhenever chaos ensues, reveal cards from the top of your planar deck until you reveal a plane card. Planeswalk to it, except don't planeswalk away from any plane. Put the rest of the revealed cards on the bottom of your planar deck in any order.","sets":["moc"],"isUB":false},{"id":"08427dab-3874-4a29-bd63-cbd16c1d229d","name":"New Argive","typeLine":"Plane — Dominaria","oracleText":"Whenever a historic creature you control attacks, it gets +2/+2 until end of turn. (Artifacts, legendaries, and Sagas are historic.)\nWhenever chaos ensues, reveal cards from the top of your library until you reveal a historic card. Put that card into your hand and the rest on the bottom of your library in a random order.","sets":["moc"],"isUB":false},{"id":"a2048704-0d22-435d-b819-269291f2981e","name":"Naktamun","typeLine":"Plane — Amonkhet","oracleText":"Each creature card in your graveyard has embalm. Its embalm cost is equal to its mana cost. (Exile a creature card from your graveyard and pay its embalm cost: Create a token that's a copy of it, except it's a white Zombie in addition to its other types with no mana cost. Embalm only as a sorcery.)\nWhenever chaos ensues, you may discard a card. If you do, draw a card.","sets":["moc"],"isUB":false},{"id":"c907333b-eae8-444f-9da3-b193289f19e2","name":"Megaflora Jungle","typeLine":"Plane — Gargantikar","oracleText":"Each creature with mana value 2 or less gets +2/+2.\nWhenever chaos ensues, create a 1/1 green Insect creature token with flying named Butterfly.","sets":["moc"],"isUB":false},{"id":"0ff2bbed-e435-4108-b02a-564a75abba40","name":"Littjara","typeLine":"Plane — Kaldheim","oracleText":"When you planeswalk to Littjara and at the beginning of your upkeep, create a 2/2 blue Shapeshifter creature token with changeling. (It is every creature type.)\nWhenever chaos ensues, choose a creature type. Put a +1/+1 counter on each creature you control of that type.","sets":["moc"],"isUB":false},{"id":"f3b27908-ca10-4793-ab8e-6639c73cfadd","name":"Ketria","typeLine":"Plane — Ikoria","oracleText":"When you planeswalk to Ketria and at the beginning of your upkeep, put your choice of a vigilance, menace, or trample counter on target creature you control.\nWhenever chaos ensues, exile cards from the top of your library until you exile a nonland permanent card. Put that card onto the battlefield or into your hand.","sets":["moc"],"isUB":false},{"id":"61c5f2cb-f39c-487c-9786-a8dad4663f4f","name":"Inys Haen","typeLine":"Plane — Cridhe","oracleText":"When you planeswalk to Inys Haen and at the beginning of your upkeep, mill three cards.\nWhen you planeswalk away from Inys Haen, each player returns all land cards from their graveyard to the battlefield tapped.\nWhenever chaos ensues, return target nonland card from your graveyard to your hand.","sets":["moc"],"isUB":false},{"id":"00f00001-bd84-4dbf-a707-f4b1549100d4","name":"The Great Aerie","typeLine":"Plane — Tarkir","oracleText":"When you planeswalk to The Great Aerie and at the beginning of your upkeep, bolster 3. (Choose a creature with the least toughness among creatures you control and put three +1/+1 counters on it.)\nWhenever chaos ensues, choose up to one target creature you control and up to one target creature an opponent controls. Each of those creatures deals damage equal to its toughness to the other.","sets":["moc"],"isUB":false},{"id":"3c200cc0-02b1-4a32-a910-5cd3c4d716b7","name":"The Golden City of Orazca","typeLine":"Plane — Ixalan","oracleText":"Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nWhenever one or more creatures you control deal combat damage to a player, create a Treasure token. Then draw a card if you have the city's blessing.\nWhenever chaos ensues, you may put a permanent card from your hand onto the battlefield tapped.","sets":["moc"],"isUB":false},{"id":"a7c6b72c-f9ec-4048-8e4c-99210e4e7b85","name":"Ghirapur","typeLine":"Plane — Kaladesh","oracleText":"At the beginning of combat on your turn, until end of turn, each noncreature, non-Vehicle artifact you control becomes a 5/3 Vehicle in addition to its other types and gains trample, haste, and crew 2.\nWhenever chaos ensues, return target noncreature artifact card from your graveyard to your hand.","sets":["moc"],"isUB":false},{"id":"2f3e71b6-0fd6-4ac5-a265-faaabe21177b","name":"The Fertile Lands of Saulvinia","typeLine":"Plane — Antausia","oracleText":"Whenever a player taps a land for mana, that player adds one mana of any type that land produced.\nWhenever chaos ensues, reveal cards from the top of your planar deck until you reveal a plane card. Chaos ensues on that plane. Then put all cards revealed this way on the bottom of your planar deck in any order.","sets":["moc"],"isUB":false},{"id":"4eebfaf3-18da-4661-b6a5-d874585e170a","name":"Esper","typeLine":"Plane — Alara","oracleText":"Artifact spells cost {1} less to cast.\nWhenever chaos ensues, creatures you control that are white, blue, and/or black become artifacts in addition to their other types until end of turn. Then each artifact creature you control gains vigilance, menace, and lifelink until end of turn.","sets":["moc"],"isUB":false},{"id":"93b3acc1-2d41-4f5f-9225-7a30ea2d8158","name":"Enigma Ridges","typeLine":"Plane — Echoir","oracleText":"When you planeswalk to Enigma Ridges, each player who controls fewer lands than the player who controls the most lands searches their library for a number of basic land cards less than or equal to the difference, reveals them, puts them into their hand, then shuffles.\nWhenever chaos ensues, draw a card, then you may put a land card from your hand onto the battlefield.","sets":["moc"],"isUB":false},{"id":"86534917-5d51-4eba-9bf5-f9fc93c83c80","name":"The Caldaia","typeLine":"Plane — Capenna","oracleText":"Creature spells you cast from your hand have blitz {3}. (If you cast a spell for its blitz cost, it gains haste and \"When this creature dies, draw a card.\" Sacrifice it at the beginning of the next end step.)\nWhenever chaos ensues, return target creature card from your graveyard to your hand.","sets":["moc"],"isUB":false},{"id":"2d84be6d-49a5-4200-8cd3-d8653dfd0899","name":"The Zephyr Maze","typeLine":"Plane — Kyneth","oracleText":"Creatures with flying get +2/+0.\nCreatures without flying get -2/-0.\nWhenever chaos ensues, target creature gains flying until end of turn.","sets":["opca","opc2"],"isUB":false},{"id":"e4b941d1-60cb-4e14-89a4-62a9785f6eda","name":"Windriddle Palaces","typeLine":"Plane — Belenon","oracleText":"Players play with the top card of their libraries revealed.\nYou may play lands and cast spells from the top of any player's library.\nWhenever chaos ensues, each player mills a card.","sets":["opca","opc2"],"isUB":false},{"id":"1c4e174e-19fb-4c0a-b762-ef6d927392c9","name":"Velis Vel","typeLine":"Plane — Lorwyn","oracleText":"Each creature gets +1/+1 for each other creature on the battlefield that shares at least one creature type with it. (For example, if two Elemental Shamans and an Elemental Spirit are on the battlefield, each gets +2/+2.)\nWhenever chaos ensues, target creature gains all creature types until end of turn.","sets":["opca","ohop"],"isUB":false},{"id":"b2c95c7a-a04c-46ef-a879-6eb08e444093","name":"Trail of the Mage-Rings","typeLine":"Plane — Vryn","oracleText":"Instant and sorcery spells have rebound. (The spell's controller exiles the spell as it resolves if they cast it from their hand. At the beginning of that player's next upkeep, they may cast that card from exile without paying its mana cost.)\nWhenever chaos ensues, you may search your library for an instant or sorcery card, reveal it, put it into your hand, then shuffle.","sets":["opca","opc2"],"isUB":false},{"id":"bbb1d13c-a3ce-4151-883a-cce9bbd584d0","name":"Tember City","typeLine":"Plane — Kinshala","oracleText":"Whenever a player taps a land for mana, Tember City deals 1 damage to that player.\nWhenever chaos ensues, each other player sacrifices a nonland permanent.","sets":["opca"],"isUB":false},{"id":"97f708de-9271-4137-a9fe-dda25b922900","name":"Tazeem","typeLine":"Plane — Zendikar","oracleText":"Creatures can't block.\nWhenever chaos ensues, draw a card for each land you control.","sets":["opca"],"isUB":false},{"id":"c85d3740-8c8d-4fef-ad33-a6f446b883ac","name":"Talon Gates","typeLine":"Plane — Dominaria","oracleText":"Any time you could cast a sorcery, you may exile a nonland card from your hand with X time counters on it, where X is its mana value. If the exiled card doesn't have suspend, it gains suspend. (At the beginning of its owner's upkeep, they remove a time counter. When the last is removed, the player casts it without paying its mana cost. If it's a creature, it has haste.)\nWhenever chaos ensues, remove two time counters from each suspended card you own.","sets":["opca","opc2"],"isUB":false},{"id":"de53c948-b371-4f79-a965-33c44d0b44de","name":"Takenuma","typeLine":"Plane — Kamigawa","oracleText":"Whenever a creature leaves the battlefield, its controller draws a card.\nWhenever chaos ensues, return target creature you control to its owner's hand.","sets":["opca","opc2"],"isUB":false},{"id":"7a425df4-7010-462e-9cb5-20389bac721c","name":"Stairs to Infinity","typeLine":"Plane — Xerex","oracleText":"Players have no maximum hand size.\nWhenever you roll the planar die, draw a card.\nWhenever chaos ensues, reveal the top card of your planar deck. You may put it on the bottom of your planar deck.","sets":["opca"],"isUB":false},{"id":"61006acf-de38-420b-ab7a-685fbd64141c","name":"Skybreen","typeLine":"Plane — Kaldheim","oracleText":"Players play with the top card of their libraries revealed.\nSpells that share a card type with the top card of a library can't be cast.\nWhenever chaos ensues, target player loses life equal to the number of cards in their hand.","sets":["opca","ohop"],"isUB":false},{"id":"70edae19-e278-401d-9772-508bd66320a6","name":"Shiv","typeLine":"Plane — Dominaria","oracleText":"All creatures have \"{R}: This creature gets +1/+0 until end of turn.\"\nWhenever chaos ensues, create a 5/5 red Dragon creature token with flying.","sets":["opca","ohop"],"isUB":false},{"id":"edd21d18-98d2-4e3f-8da1-1ba645b8f69c","name":"Sea of Sand","typeLine":"Plane — Rabiah","oracleText":"Players reveal each card they draw.\nWhenever a player draws a land card, that player gains 3 life.\nWhenever a player draws a nonland card, that player loses 3 life.\nWhenever chaos ensues, put target permanent on top of its owner's library.","sets":["opca","ohop"],"isUB":false},{"id":"f0c8ce35-b627-485c-bd64-d7eae47b8efa","name":"Sanctum of Serra","typeLine":"Plane — Serra’s Realm","oracleText":"When you planeswalk away from Sanctum of Serra, destroy all nonland permanents.\nWhenever chaos ensues, you may have your life total become 20.","sets":["opca","ohop"],"isUB":false},{"id":"b53e06af-be18-4f75-9dd0-7494ec867b13","name":"Raven's Run","typeLine":"Plane — Shadowmoor","oracleText":"All creatures have wither. (They deal damage to creatures in the form of -1/-1 counters.)\nWhenever chaos ensues, put a -1/-1 counter on target creature, two -1/-1 counters on another target creature, and three -1/-1 counters on a third target creature.","sets":["opca","ohop"],"isUB":false},{"id":"53517dbf-7b32-423a-af76-afd39b876a1a","name":"Quicksilver Sea","typeLine":"Plane — Mirrodin","oracleText":"When you planeswalk to Quicksilver Sea or at the beginning of your upkeep, scry 4. (Look at the top four cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)\nWhenever chaos ensues, reveal the top card of your library. You may play it without paying its mana cost.","sets":["opca","opc2"],"isUB":false},{"id":"34a31865-b701-4ce1-8912-29fc41ecdda3","name":"Prahv","typeLine":"Plane — Ravnica","oracleText":"If you cast a spell this turn, you can't attack with creatures.\nIf you attacked with creatures this turn, you can't cast spells.\nWhenever chaos ensues, you gain life equal to the number of cards in your hand.","sets":["opca","opc2"],"isUB":false},{"id":"f133e42a-2962-4781-b413-ce2127f17c26","name":"Pools of Becoming","typeLine":"Plane — Bolas's Meditation Realm","oracleText":"At the beginning of your end step, put the cards in your hand on the bottom of your library in any order, then draw that many cards.\nWhenever chaos ensues, reveal the top three cards of your planar deck. Each of the revealed cards' {CHAOS} abilities triggers. Then put the revealed cards on the bottom of your planar deck in any order.","sets":["opca","ohop"],"isUB":false},{"id":"29e3371d-aa41-46a9-921a-96565be47eff","name":"Otaria","typeLine":"Plane — Dominaria","oracleText":"Instant and sorcery cards in graveyards have flashback. The flashback cost is equal to the card's mana cost. (Its owner may cast the card from their graveyard for its mana cost. Then they exile it.)\nWhenever chaos ensues, take an extra turn after this one.","sets":["opca","ohop"],"isUB":false},{"id":"c7241e4b-d2c7-4801-96a3-91bb998953a1","name":"Orzhova","typeLine":"Plane — Ravnica","oracleText":"When you planeswalk away from Orzhova, each player returns all creature cards from their graveyard to the battlefield.\nWhenever chaos ensues, for each opponent, exile up to one target creature card from that player's graveyard.","sets":["opca","opc2"],"isUB":false},{"id":"69f06edb-dade-4e94-b563-e36a05e567f0","name":"Onakke Catacomb","typeLine":"Plane — Shandalar","oracleText":"All creatures are black and have deathtouch.\nWhenever chaos ensues, creatures you control get +1/+0 and gain first strike until end of turn.","sets":["opca","opc2"],"isUB":false},{"id":"9d58f647-3f83-4f65-a944-c6236db7c422","name":"Norn's Dominion","typeLine":"Plane — New Phyrexia","oracleText":"When you planeswalk away from Norn's Dominion, destroy each nonland permanent without a fate counter on it, then remove all fate counters from all permanents.\nWhenever chaos ensues, you may put a fate counter on target permanent.","sets":["opca","opc2"],"isUB":false},{"id":"72af7529-75bb-488f-801d-7148631b9e9b","name":"Nephalia","typeLine":"Plane — Innistrad","oracleText":"At the beginning of your end step, mill seven cards. Then return a card at random from your graveyard to your hand.\nWhenever chaos ensues, return target card from your graveyard to your hand.","sets":["opca","opc2"],"isUB":false},{"id":"5ed6be01-af06-4f3d-8b43-ef8993c52c97","name":"Naya","typeLine":"Plane — Alara","oracleText":"You may play any number of lands on each of your turns.\nWhenever chaos ensues, target red, green, or white creature you control gets +1/+1 until end of turn for each land you control.","sets":["opca","ohop"],"isUB":false},{"id":"3e0bcf65-1eaf-440f-a59b-0b11e1106135","name":"Naar Isle","typeLine":"Plane — Wildfire","oracleText":"At the beginning of your upkeep, put a flame counter on Naar Isle, then Naar Isle deals damage to you equal to the number of flame counters on it.\nWhenever chaos ensues, Naar Isle deals 3 damage to target player or planeswalker.","sets":["opca","ohop"],"isUB":false},{"id":"07cc253d-e23c-450c-bfaf-5cb6a3a588ce","name":"Murasa","typeLine":"Plane — Zendikar","oracleText":"Whenever a nontoken creature enters the battlefield, its controller may search their library for a basic land card, put it onto the battlefield tapped, then shuffle.\nWhenever chaos ensues, target land becomes a 4/4 creature that's still a land.","sets":["opca","ohop"],"isUB":false},{"id":"e0dc9986-1099-4189-bfff-8f41bab9019d","name":"Mount Keralia","typeLine":"Plane — Regatha","oracleText":"At the beginning of your end step, put a pressure counter on Mount Keralia.\nWhen you planeswalk away from Mount Keralia, it deals damage equal to the number of pressure counters on it to each creature and each planeswalker.\nWhenever chaos ensues, prevent all damage that planes named Mount Keralia would deal this game to permanents you control.","sets":["opca","opc2"],"isUB":false},{"id":"b6329c2f-ea7f-4611-986c-f82bacf2a872","name":"Mirrored Depths","typeLine":"Plane — Karsus","oracleText":"Whenever a player casts a spell, that player flips a coin. If the player loses the flip, counter that spell.\nWhenever chaos ensues, target player reveals the top card of their library. If it's a nonland card, you may cast it without paying its mana cost.","sets":["opca"],"isUB":false},{"id":"6491f511-87e6-4504-84f5-fe5cf44768d7","name":"Minamo","typeLine":"Plane — Kamigawa","oracleText":"Whenever a player casts a spell, that player may draw a card.\nWhenever chaos ensues, each player may return a blue card from their graveyard to their hand.","sets":["opca","ohop"],"isUB":false},{"id":"e28deac5-d3c4-48e9-974c-093e3122f317","name":"The Maelstrom","typeLine":"Plane — Alara","oracleText":"When you planeswalk to The Maelstrom or at the beginning of your upkeep, you may reveal the top card of your library. If it's a permanent card, you may put it onto the battlefield. If you revealed a card but didn't put it onto the battlefield, put it on the bottom of your library.\nWhenever chaos ensues, return target permanent card from your graveyard to the battlefield.","sets":["opca","ohop"],"isUB":false},{"id":"11b3fcb2-0b66-4d8b-8e66-a21a5da1c1f5","name":"Llanowar","typeLine":"Plane — Dominaria","oracleText":"All creatures have \"{T}: Add {G}{G}.\"\nWhenever chaos ensues, untap all creatures you control.","sets":["opca","ohop"],"isUB":false},{"id":"85592710-8637-4726-8b92-552b9be677c0","name":"Lethe Lake","typeLine":"Plane — Arkhos","oracleText":"At the beginning of your upkeep, mill ten cards.\nWhenever chaos ensues, target player mills ten cards.","sets":["opca","ohop"],"isUB":false},{"id":"ac4fe2a2-76ff-49d9-b506-26a17b4bf892","name":"Lair of the Ashen Idol","typeLine":"Plane — Azgol","oracleText":"At the beginning of your upkeep, sacrifice a creature. If you can't, planeswalk.\nWhenever chaos ensues, any number of target players each create a 2/2 black Zombie creature token.","sets":["opca","opc2"],"isUB":false},{"id":"fc650404-991c-4639-b311-c35df81a254a","name":"Kilnspire District","typeLine":"Plane — Ravnica","oracleText":"When you planeswalk to Kilnspire District or at the beginning of your precombat main phase, put a charge counter on Kilnspire District, then add {R} for each charge counter on it.\nWhenever chaos ensues, you may pay {X}. If you do, Kilnspire District deals X damage to any target.","sets":["opca","opc2"],"isUB":false},{"id":"b54d9a4a-1d55-4ceb-96fd-2b1d5e46de14","name":"Kessig","typeLine":"Plane — Innistrad","oracleText":"Prevent all combat damage that would be dealt by non-Werewolf creatures.\nWhenever chaos ensues, each creature you control gets +2/+2, gains trample, and becomes a Werewolf in addition to its other types until end of turn.","sets":["opca","opc2"],"isUB":false},{"id":"e5f8b2bb-e9bb-4a0a-aa88-7fa0299f52a9","name":"Izzet Steam Maze","typeLine":"Plane — Ravnica","oracleText":"Whenever a player casts an instant or sorcery spell, that player copies it. The player may choose new targets for the copy.\nWhenever chaos ensues, instant and sorcery spells you cast this turn cost {3} less to cast.","sets":["opca","ohop"],"isUB":false},{"id":"ece3b5ed-3c07-4586-bf99-72bc1aa6ccef","name":"Immersturm","typeLine":"Plane — Valla","oracleText":"Whenever a creature enters the battlefield, that creature's controller may have it deal damage equal to its power to any target of their choice.\nWhenever chaos ensues, exile target creature, then return it to the battlefield under its owner's control.","sets":["opca","ohop"],"isUB":false},{"id":"065346cd-cd81-478e-8a62-2c7ea421bdcd","name":"Horizon Boughs","typeLine":"Plane — Pyrulea","oracleText":"All permanents untap during each player's untap step.\nWhenever chaos ensues, you may search your library for up to three basic land cards, put them onto the battlefield tapped, then shuffle.","sets":["opca"],"isUB":false},{"id":"cde8d8c4-5e2b-452f-b3e9-bb9f2e745ec9","name":"The Hippodrome","typeLine":"Plane — Segovia","oracleText":"All creatures get -5/-0.\nWhenever chaos ensues, you may destroy target creature if its power is 0 or less.","sets":["opca","ohop"],"isUB":false},{"id":"1aaa60e4-47a8-4255-8a09-5f00922ccf6d","name":"Grixis","typeLine":"Plane — Alara","oracleText":"Blue, black, and/or red creature cards in your graveyard have unearth. The unearth cost is equal to the card's mana cost. (Pay the card's mana cost: Return it to the battlefield. The creature gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)\nWhenever chaos ensues, put target creature card from a graveyard onto the battlefield under your control.","sets":["opca","ohop"],"isUB":false},{"id":"fb9651f5-1aec-4812-a044-3c1b60e6651f","name":"Grand Ossuary","typeLine":"Plane — Ravnica","oracleText":"Whenever a creature dies, its controller distributes a number of +1/+1 counters equal to its power among any number of target creatures they control.\nWhenever chaos ensues, each player exiles all creatures they control and creates X 1/1 green Saproling creature tokens, where X is the total power of the creatures they exiled this way. Then planeswalk.","sets":["opca","opc2"],"isUB":false},{"id":"f12400e5-8288-48e1-b3b7-0cc4f8d9ca67","name":"Goldmeadow","typeLine":"Plane — Lorwyn","oracleText":"Whenever a land enters the battlefield, that land's controller creates three 0/1 white Goat creature tokens.\nWhenever chaos ensues, create a 0/1 white Goat creature token.","sets":["opca","ohop"],"isUB":false},{"id":"662e5245-73e4-49ba-aece-c73f1bea7b6a","name":"Glen Elendra","typeLine":"Plane — Lorwyn","oracleText":"At end of combat, you may exchange control of target creature you control that dealt combat damage to a player this combat and target creature that player controls.\nWhenever chaos ensues, gain control of target creature you own.","sets":["opca","opc2"],"isUB":false},{"id":"1799d361-85e7-4c04-aa04-6f83e6499573","name":"Furnace Layer","typeLine":"Plane — New Phyrexia","oracleText":"When you planeswalk to Furnace Layer or at the beginning of your upkeep, select target player at random. That player discards a card. If that player discards a land card this way, they lose 3 life.\nWhenever chaos ensues, you may destroy target nonland permanent.","sets":["opca","opc2"],"isUB":false},{"id":"13e801cd-e537-4ea6-8c3d-21b142bdc026","name":"The Fourth Sphere","typeLine":"Plane — Phyrexia","oracleText":"At the beginning of your upkeep, sacrifice a nonblack creature.\nWhenever chaos ensues, create a 2/2 black Zombie creature token.","sets":["opca","ohop"],"isUB":false},{"id":"81a0d96a-7ac8-4947-8779-2102c9b33d38","name":"Fields of Summer","typeLine":"Plane — Moag","oracleText":"Whenever a player casts a spell, that player may gain 2 life.\nWhenever chaos ensues, you may gain 10 life.","sets":["opca","ohop"],"isUB":false},{"id":"b1eff630-b56c-48a5-ac21-836a60157b35","name":"Feeding Grounds","typeLine":"Plane — Muraganda","oracleText":"Red spells cost {1} less to cast.\nGreen spells cost {1} less to cast.\nWhenever chaos ensues, put X +1/+1 counters on target creature, where X is that creature's mana value.","sets":["opca","ohop"],"isUB":false},{"id":"a04d05ed-1b9b-4407-8780-c75c102a94dd","name":"The Eon Fog","typeLine":"Plane — Equilor","oracleText":"Players skip their untap steps.\nWhenever chaos ensues, untap all permanents you control.","sets":["opca","ohop"],"isUB":false},{"id":"23fe1c21-c396-4ebf-a8b0-22d697952b34","name":"Eloren Wilds","typeLine":"Plane — Shandalar","oracleText":"Whenever a player taps a permanent for mana, that player adds one mana of any type that permanent produced.\nWhenever chaos ensues, target player can't cast spells until a player planeswalks.","sets":["opca","ohop"],"isUB":false},{"id":"cb467901-a68d-4922-8ceb-867b582c8fe7","name":"Edge of Malacol","typeLine":"Plane — Belenon","oracleText":"If a creature you control would untap during your untap step, put two +1/+1 counters on it instead.\nWhenever chaos ensues, untap each creature you control.","sets":["opca","opc2"],"isUB":false},{"id":"5503c308-560d-4d5f-a86a-4b06d9947ddc","name":"The Dark Barony","typeLine":"Plane — Ulgrotha","oracleText":"Whenever a nonblack card is put into a player's graveyard from anywhere, that player loses 1 life.\nWhenever chaos ensues, each opponent discards a card.","sets":["opca","ohop"],"isUB":false},{"id":"b21a71d7-f236-43e2-b576-0b5c9280f0cc","name":"Cliffside Market","typeLine":"Plane — Mercadia","oracleText":"When you planeswalk to Cliffside Market or at the beginning of your upkeep, you may exchange life totals with target player.\nWhenever chaos ensues, exchange control of two target permanents that share a card type.","sets":["opca","ohop"],"isUB":false},{"id":"2979597d-c3cc-4585-a9b7-7fa15641b030","name":"Celestine Reef","typeLine":"Plane — Luvion","oracleText":"Creatures without flying or islandwalk can't attack.\nWhenever chaos ensues, until a player planeswalks, you can't lose the game and your opponents can't win the game.","sets":["opca"],"isUB":false},{"id":"82e67c57-6d7a-44cc-ba63-77ce887ab075","name":"Bant","typeLine":"Plane — Alara","oracleText":"All creatures have exalted. (Whenever a creature attacks alone, it gets +1/+1 until end of turn for each instance of exalted among permanents its controller controls.)\nWhenever chaos ensues, put a divinity counter on target green, white, or blue creature. That creature has indestructible for as long as it has a divinity counter on it.","sets":["opca","ohop"],"isUB":false},{"id":"805f9dc2-e172-481d-bae7-9a136a3d1e49","name":"Astral Arena","typeLine":"Plane — Kolbahan","oracleText":"No more than one creature can attack each combat.\nNo more than one creature can block each combat.\nWhenever chaos ensues, Astral Arena deals 2 damage to each creature.","sets":["opca","opc2"],"isUB":false},{"id":"d6ab4159-e04e-4991-8a9b-9da302c98e9d","name":"Aretopolis","typeLine":"Plane — Kephalai","oracleText":"When you planeswalk to Aretopolis or at the beginning of your upkeep, put a scroll counter on Aretopolis, then you gain life equal to the number of scroll counters on it.\nWhen Aretopolis has ten or more scroll counters on it, planeswalk.\nWhenever chaos ensues, put a scroll counter on Aretopolis, then draw cards equal to the number of scroll counters on it.","sets":["opca","opc2"],"isUB":false},{"id":"25650a32-4014-4065-ad01-7357c3ad3995","name":"Akoum","typeLine":"Plane — Zendikar","oracleText":"Players may cast enchantment spells as though they had flash.\nWhenever chaos ensues, destroy target creature that isn't enchanted.","sets":["opca","opc2"],"isUB":false},{"id":"38f84e55-049c-441e-b4e2-1e207ab5dbe5","name":"Agyrem","typeLine":"Plane — Ravnica","oracleText":"Whenever a white creature dies, return it to the battlefield under its owner's control at the beginning of the next end step.\nWhenever a nonwhite creature dies, return it to its owner's hand at the beginning of the next end step.\nWhenever chaos ensues, creatures can't attack you until a player planeswalks.","sets":["opca","ohop"],"isUB":false},{"id":"15b979de-c8ee-4664-9ca7-6c4eb3346967","name":"Academy at Tolaria West","typeLine":"Plane — Dominaria","oracleText":"At the beginning of your end step, if you have no cards in hand, draw seven cards.\nWhenever chaos ensues, discard your hand.","sets":["opca","ohop"],"isUB":false},{"id":"e19e8895-f8a4-4995-8dd4-2821c6469126","name":"Time Distortion","typeLine":"Phenomenon","oracleText":"When you encounter Time Distortion, reverse the game's turn order. (For example, if play had proceeded clockwise around the table, it now goes counterclockwise. Then planeswalk away from this phenomenon.)","sets":["opca","opc2"],"isUB":false},{"id":"302e4ac2-522b-4a0a-850a-d856639ea2a4","name":"Morphic Tide","typeLine":"Phenomenon","oracleText":"When you encounter Morphic Tide, each player shuffles all permanents they own into their library, then reveals that many cards from the top of their library. Each player puts all artifact, creature, land, and planeswalker cards revealed this way onto the battlefield, then does the same for enchantment cards, then puts all cards revealed this way that weren't put onto the battlefield on the bottom of their library in any order. (Then planeswalk away from this phenomenon.)","sets":["opca","opc2"],"isUB":false},{"id":"7812174b-2dc1-43e8-b98f-639905e20ab7","name":"Interplanar Tunnel","typeLine":"Phenomenon","oracleText":"When you encounter Interplanar Tunnel, reveal cards from the top of your planar deck until you reveal five plane cards. Put a plane card from among them on top of your planar deck, then put the rest of the revealed cards on the bottom in a random order. (Then planeswalk away from this phenomenon.)","sets":["opca","opc2"],"isUB":false}]